DIGIBANK_uSER_pROFILE-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: DIGIBANK_uSER_pROFILE-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: DIGIBANK_uSER_pROFILE-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  DIGIBANK_uSER_pROFILE-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1920,969)
      - go(http://localhost:8080/bank/login)
      - clickByID(username)
      - typeByID(username): "jsmith@demo.io"
      - clickByID(password)
      - typeByID(password): "Demo123!"
      - clickByID(submit)
    - label: Click Profile
      actions:
      - clickByCSS(img.user-avatar.rounded-circle)
      - clickByLinkText(My Profile)
      - clickByID(firstName)
      - clickByID(firstName)
      - doubleClickByID(firstName)
      # WARN: Command Not yet supported. ('contextMenuAt:"id=firstName":"37,25"')
      - clickByID(firstName)
      # WARN: Command Not yet supported. ('contextMenuAt:"id=firstName":"270,14"')
      - clickByID(firstName)
      - clickByID(firstName)
      # WARN: Command Not yet supported. ('contextMenuAt:"id=firstName":"33,22"')
      - clickByCSS(body)
      # WARN: Command Not yet supported. ('contextMenuAt:"id=firstName":"31,21"')
      - clickByID(firstName)
      - clickByID(firstName)
      - clickByID(firstName)
      - doubleClickByID(firstName)
      # WARN: Command Not yet supported. ('contextMenuAt:"id=firstName":"21,13"')
      - clickByID(firstName)
      # WARN: Command Not yet supported. ('contextMenuAt:"id=firstName":"358,24"')
      - clickByID(lastName)
      # WARN: Command Not yet supported. ('contextMenuAt:"id=lastName":"165,24"')
    - label: Home Page
      actions:
      - clickByID(home-menu-item)
    - label: Logout
      actions:
      - clickByCSS(img.user-avatar.rounded-circle)
      - clickByLinkText(Logout)
      - clickByCSS(div.sufee-alert.alert.with-close.alert-success.alert-dismissible.fade.show)
      # WARN: Command Not yet supported. ('contextMenuAt:"css=div.sufee-alert.alert.with-close.alert-success.alert-dismissible.fade.show":"86,23"')

  DIGIBANK_uSER_pROFILE-Http:
    headers:
      sec-ch-ua: '"Chromium";v="106", "Google Chrome";v="106", "Not;A=Brand";v="99"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/106.0.0.0 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:8080/bank/login'
            method: POST
            label: 'http://localhost:8080/bank/login'
            think-time: 0ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              password: 'Demo123!'
              username: jsmith@demo.io
      - transaction: Click Profile
        force-parent-sample: false
        do:
          - url: 'http://localhost:8080/bank/user/profile'
            method: GET
            label: 'http://localhost:8080/bank/user/profile'
            think-time: 43680ms
            headers: {}
      - transaction: Home Page
        force-parent-sample: false
        do:
          - url: 'http://localhost:8080/bank/home'
            method: GET
            label: 'http://localhost:8080/bank/home'
            think-time: 107198ms
            headers: {}
      - transaction: Logout
        force-parent-sample: false
        do:
          - url: 'http://localhost:8080/bank/logout'
            method: GET
            label: 'http://localhost:8080/bank/logout'
            assert:
              - assume-success: false
                contains:
                  - "Logout(&.+;|\\W)+completed(&.+;|\\W)+"
                not: false
                regexp: false
                subject: body
            think-time: 16443ms
            headers: {}